programming/python/sample.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>sample.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	  <a href="/diary/programming/python/pygame.org.html">Prev: pygame.org</a>
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/programming/python">Up: python</a>
	  	
	</span>

	<span id="next">
	  
	  <a href="/diary/programming/python/tools.org.html">Next: tools.org</a>
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="atexit">atexit</h1>
<p>来自于标准库，手册见 <a href="https://docs.python.org/3/library/atexit.html">https://docs.python.org/3/library/atexit.html</a>， 类似于 Linux <code>atexit()</code> 函数</p>
<p>以与注册相反的顺序被调用</p>
<div class="sourceCode" id="cb1" data-results="output"><pre class="sourceCode python"><code class="sourceCode python"><span id="cb1-1"><a href="#cb1-1"></a><span class="im">import</span> atexit</span>
<span id="cb1-2"><a href="#cb1-2"></a></span>
<span id="cb1-3"><a href="#cb1-3"></a>atexit.register(<span class="bu">print</span>, <span class="st">&quot;call 1&quot;</span>)</span>
<span id="cb1-4"><a href="#cb1-4"></a>atexit.register(<span class="bu">print</span>, <span class="st">&quot;call 2&quot;</span>)</span>
<span id="cb1-5"><a href="#cb1-5"></a>atexit.register(<span class="bu">print</span>, <span class="st">&quot;call 3&quot;</span>)</span></code></pre></div>
<h1 id="f-string">f-string</h1>
<p>3.6 时引入，同类的还有 "r", "b", "u" (python3 中 "u" 是默认的)。在生成 bytecode 时被解析，执行速度更快</p>
<div class="sourceCode" id="cb2" data-results="output"><pre class="sourceCode python"><code class="sourceCode python"><span id="cb2-1"><a href="#cb2-1"></a>world <span class="op">=</span> <span class="st">&quot;世界&quot;</span></span>
<span id="cb2-2"><a href="#cb2-2"></a><span class="bu">print</span>(<span class="st">&quot;你好，</span><span class="sc">{}</span><span class="st">&quot;</span>.<span class="bu">format</span>(world))</span>
<span id="cb2-3"><a href="#cb2-3"></a><span class="bu">print</span>(<span class="ss">f&quot;你好，</span><span class="sc">{</span>world<span class="sc">}</span><span class="ss">&quot;</span>)</span>
<span id="cb2-4"><a href="#cb2-4"></a><span class="bu">print</span>(<span class="ss">f&quot;你好, </span><span class="sc">{</span><span class="st">&#39;world&#39;</span><span class="sc">.</span>upper()<span class="sc">}</span><span class="ss">&quot;</span>)</span></code></pre></div>
<p>其它方式还有</p>
<ul class="incremental">
<li>"%" operator</li>
<li><code>.format()</code> 方法</li>
<li><code>strings.Template()</code> 函数</li>
</ul>
<h1 id="timeit">timeit</h1>
<div class="sourceCode" id="cb3" data-results="output"><pre class="sourceCode python"><code class="sourceCode python"><span id="cb3-1"><a href="#cb3-1"></a><span class="im">import</span> timeit</span>
<span id="cb3-2"><a href="#cb3-2"></a></span>
<span id="cb3-3"><a href="#cb3-3"></a>setup <span class="op">=</span> <span class="st">&#39;&#39;&#39;</span></span>
<span id="cb3-4"><a href="#cb3-4"></a><span class="st">def fib(n):</span></span>
<span id="cb3-5"><a href="#cb3-5"></a><span class="st">    if n &lt; 3:</span></span>
<span id="cb3-6"><a href="#cb3-6"></a><span class="st">        return 1</span></span>
<span id="cb3-7"><a href="#cb3-7"></a><span class="st">    else:</span></span>
<span id="cb3-8"><a href="#cb3-8"></a><span class="st">        return fib(n-1) + fib(n-2)</span></span>
<span id="cb3-9"><a href="#cb3-9"></a></span>
<span id="cb3-10"><a href="#cb3-10"></a><span class="st">def fib2(n):</span></span>
<span id="cb3-11"><a href="#cb3-11"></a><span class="st">    s, b = 1, 1</span></span>
<span id="cb3-12"><a href="#cb3-12"></a><span class="st">    for _ in range(n-1):</span></span>
<span id="cb3-13"><a href="#cb3-13"></a><span class="st">        s, b = b, s+b</span></span>
<span id="cb3-14"><a href="#cb3-14"></a><span class="st">    return s</span></span>
<span id="cb3-15"><a href="#cb3-15"></a><span class="st">&#39;&#39;&#39;</span></span>
<span id="cb3-16"><a href="#cb3-16"></a></span>
<span id="cb3-17"><a href="#cb3-17"></a><span class="bu">print</span>(<span class="st">&quot;recur&quot;</span>, timeit.timeit(stmt<span class="op">=</span><span class="st">&quot;fib(20)&quot;</span>, setup<span class="op">=</span>setup, number<span class="op">=</span><span class="dv">1000</span>))</span>
<span id="cb3-18"><a href="#cb3-18"></a><span class="bu">print</span>(<span class="st">&quot;loop &quot;</span>, timeit.timeit(stmt<span class="op">=</span><span class="st">&quot;fib2(20)&quot;</span>, setup<span class="op">=</span>setup, number<span class="op">=</span><span class="dv">1000</span>))</span>
<span id="cb3-19"><a href="#cb3-19"></a></span>
<span id="cb3-20"><a href="#cb3-20"></a><span class="co"># exec(setup)</span></span>
<span id="cb3-21"><a href="#cb3-21"></a><span class="co"># print(fib(20), fib2(20))</span></span></code></pre></div>

      </div>
    </section>
  </body>
</html>
